#define _CRT_SECURE_NO_WARNINGS
// Hpro.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//
//소스파일
//주석 : 프로그램에서 실행이 되지 않는 부분
//컴파일러가 무시하는 문항
/* 
컴파일러 : 사람이 써 놓은 코드를 기계가 알아듣게 번역해줌
  -> 목적코드 생성 
*/

/*
ctrl + D 한줄 복제하기
shift + Delete 한줄 삭제하기
ALt shift 화살표 : 새로 블럭 잡기 
shift 화살표 : 한줄 잡기
ctrl + space 자동완성기능
alt + 화살표 위 아래: 줄 바꾸기
프로그램 디버그 <F5> 또는 [디버그] > [디버깅 시작] 메뉴
CTRL +B+B 프로젝트 빌드 
빌드 : 실행 파일 생성하기
리빌드 : 전체를 다시 빌드하기 (정리 + 빌드)
CTRL + B + R : 재빌드
ctrl + 화살표 : 페이지 업 다운
ctrl + k + c : 블럭 영역 전부 주석처리
ctrl + k + u : 블럭 영역 전부 주석처리 해제
*/ 

/*
변수(Variable)
 - 변하는 숫자
 - 컴퓨터에 값을 기억시키기 위해 만들고 사용
 - 메모리라는 곳에 저장

 연산자 (operator)
- 계산을 하기 위한 기호
- 대입 연산자
  1. = 오른쪽에 있는 값을 왼쪽에 넣어라
      @ a=b b에 있는 값을 a에 넣어라 
- 산술 연산자
  사칙연산 + - * /
  % (나머지 연산)
   a = 5%3 a는 2가 들어간다 ( 5를 3으로 나누었을 때 나머지가 2)
- 복합 대입 연산자
   줄여쓰기용
   a+=b; //아래와 같은 코드
   a = a+b; 
- 증감 연산자
    a++; //a에다가 1을 더해라
    a--; //a에다가 1을 빼라

*/




//#include <iostream> //입출력 관련
//#include <cstdio>   // stdio.h
//#include <stdio.h>  
//#include "header.h"
 

//int main() //앤트리 포인트 코드가 시작되는 곳

//{
//    std::cout << "Hello World!\n"; //이것을 출력하기 C++ 출력 방법
//    printf("Hello World\n");
//    printf("\"heejae\"\t");
//    printf("98년생입니다.");
////    
////    //int : 정수형(소수점이 없는 숫자 ex/ 5,-1 ,0 ,66 ...)
////    //number = 5.3;  // 소주점 아래는 모두 버림 5만 저장
////    //number = 5 / 2; // 2.5 ===> 0.5 버림
////
//   int number;      // number라는 이름을 가진 int(인티저)변수를 선언하고 거기에 0을 대입한다.
//   number = 0;   //변수에 값을 대입
//   scanf("%d", &number); //숫자를 하나 입력 받고(c)
//   printf("입력한 숫자는 : %d\n", number);
//   std::cin >> number; //숫자를 하나 입력 받기(c++)
//   printf("입력한 숫자는 : %d\n", number);
//  
////프로그램을 실행 했을 때 나이를 물어보고 입력받은 숫자를 그대로 출력 아래
//
//  printf("나이를 입력하세요 : %d\n", number);
//    
//
//    // 이스케이프 스퀸스
//    // \n 줄바꾸기
//    // \t 탭 넣기
//    // \\ : \찍기
//    // 캐리지 리턴
//
//
//  int number1 = 0;
//  int number2 = 0;
//
//  printf("숫자 1을 입력하시오 : ");
//  std::cin >> number1;
//  printf("숫자 2를 입력하시오 : ");
//  std::cin >> number2;
//  int number3 = number1 + number2;
//  printf("두 숫자의 합은 %d입니다.,", number3);
//  //printf 문을 이용해서 아래와 같은 모양 찍어보기
//  printf("  *\n");
//  printf(" ***\n");
//  printf("*****\n");
//
//  //특수문자를 이용해서 미로 모양 출력해보기
//  printf("□□□□□□□□\n");
//  printf("□ □  □ □\n");
//  printf("□  □   □\n");
//  printf("□□□□□□□□\n");
//  //두 수를 입력받아 스왑하기
//  
// 
//  //printf("숫자를 하나 입력하세요 : %d\n", number1);
//  //std::cin >> number1
//  //printf("숫자를 하나 더 입력하세요 : %d\n", number2);
//  //std::cin >> number2;
// 
//  
//
//
//  //두 수를 입력 받아 나머지를 출력하기(% 연산자 사용 금지)
//
//  // 사각형
//  
//  
//
//  return 0;
//}
////커밋 : 세이브 포인트 만들기
//
//
//
//커밋 연습 ㅁㄴㅇㄻㄴㅇㄻㄴㅇㄹ
// 추가할 내용



// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
